html_out = "\"1\" + 2 + 3 -> " + ("1" + 2 + 3) + " | " + "Конкатинация: строка + число, дважды\n" +
	"1 + 2 + \"3\" -> " + (1 + 2 + "3") + " | " + "Сложение чисел, конкатинация: число + строка\n" +
	"\"1\" - 2 -> " + ("1" - 2) + " | " + "Из-за \"-\" строка приводится к числу, а далее идет вычитание\n" +
	"\"1\" +- 2 -> " + ("1" +- 2) + " | " + "Конкатинация: строка + отрицательное число\n" +
	"\"1\" + \"1\" - \"1\" -> " + ("1" + "1" - "1") + " | " + "Конкатинация, затем из-за \"-\" они приводятся к числам, затем вычитание\n" +
	"\"foo\" +- \"bar\" -> " + ("foo" +- "bar") + " | " + "Конкатинация: строка + NaN (\"-\" не-число -> NaN)\n" +
	"0 == \"0\" -> " + (0 == "0") + " | " + "При нестрогом равенстве строка приводится к числу\n" +
	"0.5 + 0.1 == 0.6 -> " + (0.5 + 0.1 == 0.6) + " | " + "Точное в двоичной системе (для чисел с плавующей запятой)\n" +
	"0.1 + 0.2 == 0.3 -> " + (0.1 + 0.2 == 0.3) + " | " + "0.1 + 0.2 = 0.30000000000000004 -> классическая проблема\n" +
	"true + true + true == 3 -> " + (true + true + true == 3) + " | " + "True = 1, для арифметики\n" +
	"true == 1 -> " + (true == 1) + " | " + "True приводится к 1 (false к 0) для нестрогого равенства\n" +
	"true === 1 -> " + (true === 1) + " | " + "При строгом равенстве учитывается разность типов\n" +
	"1 < 2 < 3 -> " + (1 < 2 < 3) + " | " + "1 < 2 -> true, true < 3, т.к. true приводится к 1\n" +
	"3 > 2 > 1 -> " + (3 > 2 > 1) + " | " + "3 > 2 -> true, true < 1 -> false, т.к. true приводится к 1\n" +
	"9007199254740991 + 1 == 9007199254740991 + 2 -> " + (9007199254740991 + 1 == 9007199254740991 + 2) + " | " + "9007199254740991 = 2**53 - 1 -> последнее безопасное целое, больше нельзя\n" +
	"Math.sqrt(-1) == Math.sqrt(-1) -> " + (Math.sqrt(-1) == Math.sqrt(-1)) + " | " + "Math.sqrt(-1) -> NaN, по спецификации NaN не равен ничему, даже самому себе\n"

document.getElementById('output').style.fontSize = "30px";
document.getElementById('output').innerText = html_out;